//
//  Data.swift
//  00757001-Data binding
//
//  Created by HungJie on 2020/10/28.
//

import Foundation


struct location{
    var name : String
    var photo : String
    var distance : Double
    var time : Double
    var hour : Int
    var description: String
    var latitude : Double
    var longitude : Double
    var address : String
}

let keelung : [location] = [
    location(name: "基隆中正公園", photo: "zzpark", distance: 6, time: 0.25, hour: 24, description: "基隆中正公園在基隆港東側山丘上，依山建築，草木扶疏，是市民平日休閒的最佳去處。是基隆市最具代表性的地標。在佛像的兩側，有兩頭巨大的金獅坐鎮，十分祥和莊嚴。而在佛像周圍也立了十八座羅漢的雕像，每尊表情、動作都不一樣，十分生動，相當有趣。中正公園的廣場前可以俯瞰整個港口以及市街景象，視野非常的開闊，尤其黃昏之後，由這裡觀看基隆夜景，別具特色。", latitude: 25.133298, longitude: 121.750641, address: "基隆市中正區壽山路"),
    location(name: "外木山風景區", photo: "yms", distance: 12, time: 0.5, hour: 17, description: "外木山海岸為基隆市轄區僅存最長的天然海岸。自外木山漁港至澳底通村全長約5公里的海岸公路。一側為開闊的海岸景觀，一側為高聳的單面山懸崖，是極富壯麗景色的海岸線。在澳底漁村的沙灘是僅存的沙岸地型，小而美麗，夏日時成為民眾戲水游泳的好去處。夏季的日出是海岸不可多得的美景，坐在岸邊聆聽濤聲，欣賞彩霞萬丈之景，令人心曠神怡。海岸礁岩長年經海水沖蝕，雕塑出奇特的造形，值得民眾深入觀賞體會。", latitude: 25.163327, longitude: 121.727109, address: " 基隆市中山區湖海路一段"),
    location(name: "情人湖公園", photo: "couplepark", distance: 12, time: 0.5, hour: 17, description: "情人湖公園位於基隆市西郊外寮里的大武崙山山腰上，由六條小溪匯集流入而成，為基隆僅有的高地湖泊，湖面雖然沒有很寬闊，但景色精緻秀麗，頗有小家碧玉之美，附近林木茂密，湖水碧綠，山光水色，清新怡人，春夏時節到處蟲鳴鳥叫，彩蝶飛舞，候鳥遷徒，值得民眾共赴自然之約。", latitude: 25.157159, longitude:  121.705898, address: "基隆市安樂區基金一路208巷"),
    location(name: "和平島公園", photo: "peacepark", distance: 3, time: 0.2, hour: 18, description: "和平島公園位於基隆港港口東側，島上奇岩異石林立，海岸奇特的海蝕地形景觀，如海蝕平臺、豆腐岩、海蝕溝、海蝕崖、風化窗、萬人堆、千疊敷、海蝕洞、蕈狀岩等。本區雖長年受海風吹襲，但藻生植物和魚生物，均隨季節的不同，而遨遊於公園周圍。公園以最少的人工設施來減少對自然破壞，以維繫自然生態的心來建設這美麗的自然寶藏，是北臺灣遊憩攬勝及自然教學的自然教室。", latitude: 25.160683 , longitude: 121.763893, address: "基隆市中正區平一路360號"),
    location(name: "潮境公園", photo: "nmnst", distance: 3, time: 0.2, hour: 24, description: "潮境公園是基隆市的新興景點，每逢假日遊客絡繹不絕，因為整座公園裡的生態豐富，風景秀麗，其潮間帶的豐富生態，更是親子假日遊憩、學童戶外教學的好去處。此地除了可以欣賞美麗海景外，白天可以近距離觀賞番仔澳灣周遭海域的海岸地質及生態景觀，也可遠眺基隆山之風光，而當日暮低垂時分，不僅可以看到迷人的夕陽、陸續亮起的九份燈火如寶石般閃爍，令人目不暇給以外，海面上與之輝映的點點漁火更是不可錯過的絕佳景像。", latitude: 25.144110, longitude: 121.803400, address: "基隆市中正區北寧路369巷61號")]
    
let ruifang : [location] = [
    location(name: "深澳岬角(象鼻岩)", photo: "elephant", distance: 7, time: 0.3, hour: 17, description: "深澳岬角位於新北市瑞芳區深澳漁港旁的海岬。舊稱為「番仔澳」的此岬岩長約800公尺、高約81至35公尺之間。是受東北季風影響、以及地質軟硬不同造成差異侵蝕的海蝕平台，有喚作「印地安人酋長岩」、「象鼻岩」等各類奇岩怪石。", latitude: 25.135489, longitude: 121.824565, address: "新北市瑞芳區深澳路189-5號"),
    location(name: "五分山", photo: "mountfive", distance: 23, time: 0.75, hour: 17, description: "五分山位於新北市的平溪、瑞芳和基隆的暖暖之間，名列台灣小百岳，五分山步道沿稜而行，遠觀有如萬里長城，為壯麗的風景憑添動人的曲線。其中五分山西峰瞭望亭一帶的展望最佳，晴天時可遠眺台北盆地、基隆嶼、野柳、紅淡山和平溪等地。", latitude: 25.070932,longitude:121.780623, address: "新北市瑞芳區靜安路四段1巷1號"),
    location(name: "不厭亭", photo: "buyan", distance: 18, time: 0.75, hour: 24, description: "不厭亭位於臺102線公路上雙溪與九份交界處附近，為前雙溪區鄉長簡華祥先生所命名，取自李白詩句「相看兩不厭」，因其一面眺望雙溪區全鄉風景，另一面則可遠眺瑞芳，天氣好時甚至還可以看到遠方湛藍的海水，特定時候甚至還能看得到雲海，景觀佳好，不負「不厭亭」之名。", latitude: 25.089442, longitude: 121.847512, address: "新北市瑞芳區瑞雙公路"),
    location(name: "鼻頭角", photo: "nosehead", distance: 18, time: 0.5, hour:17, description: "鼻頭角集東北角海岸海蝕地形之大成，尤其海崖、海蝕凹和海蝕平臺之發育更冠絕全臺。海蝕平臺上滿佈著蕈狀岩、蜂窩岩、豆腐岩及生痕化石，賞景之餘，亦為戶外教學一處極佳的自然地質教室。沿著往鼻頭國小的石徑漫步，海與天共一色的美景迎面而來，步道的盡頭即為鼻頭角燈塔。", latitude: 25.122835,longitude: 121.916424, address: "新北市瑞芳區鼻頭路1號"),
    location(name: "黃金瀑布", photo: "goldwater", distance: 13, time: 0.5, hour: 17, description: "黃金瀑布位置就在往水湳洞的公路邊，可看到流水從地下伏流湧出，滲入礦區後，與黃鐵礦和硫砷銅礦接觸，經過氧化還原與鐵菌催化使瀑布水呈現金黃偏橘色的酸礦水，遠看猶如一幅巨型的黃金岩壁，此等奇觀被後人美其名為黃金瀑布", latitude: 25.117120, longitude: 121.861493, address: "新北市瑞芳區金水公路"),
    location(name: "十分瀑布", photo: "tenwater", distance: 20, time: 0.6, hour: 15, description: "十分瀑布是垂簾型瀑布，岩層傾向與水流方向相反，屬逆斜層特徵，因與北美洲尼加拉瀑布相似，故有台灣尼加拉瀑布的美稱。 氣勢輝弘，水聲隆隆，聲勢浩大，非常壯觀，觀賞此景，令人不禁讚嘆大自然鬼斧神工。水潭上方瀰漫著水氣，若剛好有陽光照射，還會出現一道斜掛在瀑布上的彩虹，所以也有「彩虹淵」的別稱。", latitude: 25.048997, longitude: 121.788060, address: "新北市平溪區乾坑10號"),
    location(name: "報時山觀景臺", photo: "timeplace", distance: 15, time: 0.5, hour: 17, description: "報時山又名水螺山，海拔260公尺，據傳在日治時代設有警報器定時鳴放因而得名。這條步道不僅好走，景觀更是沒話說。其中的「朝日亭」是欣賞日出的好地方，觀景台更可看到360度的無敵景觀，包括基隆山、無耳茶壺山、陰陽海、十三層遺址、金瓜石、金水公路等地，將層層相連的山巒及海天一色的美景盡收眼底。", latitude: 25.113610, longitude: 121.859494, address: "新北市瑞芳區祈堂路53號")]

let wanli : [location] = [
    location(name: "野柳地質公園", photo: "yehliu", distance: 33, time: 0.75, hour: 15, description: "野柳地質公園位於新北市萬里區沿海地區，因地形受風化作用，而成為北海岸相當著名地質及奇石的風景名勝地，屬於北海岸及觀音山國家風景區。美國有線電視新聞網CNN曾報導過「野柳地質公園」的獨特美景，形容這裡可媲美太空地質，是地球上最像火星的岩石環境。走訪一趟可飽覽眾多奇岩美石，包含享譽國際的「女王頭」，以及如「冰淇淋石」、「蜂窩石」、「薑石」、「燭台石」等必賞海蝕奇觀。", latitude: 25.206346, longitude: 121.690431, address: "灣新北市萬里區野柳里港東路167-1號"),
    location(name: "中角海濱公園", photo: "middlepark", distance: 28, time: 1, hour: 15, description: "中角沙珠灣位在金山區台二線39公里處，是東北角衝浪聖地之一，這裡的沙灘屬於細沙，小石子較少，加上淺灘區的範圍不小，很適合帶小朋友來戲水。海上常見衝浪客在此飆浪，不時會舉辦衝浪比賽，跟小朋友一起玩水戲沙時還能觀賞他們帥氣的身手。", latitude: 25.241471, longitude: 121.633664, address: "新北市金山區海興路180-3號"),
    location(name: "石門洞", photo: "hole", distance: 40, time: 1, hour: 15, description: "石門海石洞經過海浪沖鑿、地殼抬升作用，形成今日高約10公尺的拱門特殊天然池景，沿著海岸線鋪設的步道與觀景平台，擁有欣賞海景的遼闊視野，漫步其中可以觀浪聽濤、可以賞景攝影，別有洞天的風情，讓旅人流連忘返。", latitude: 25.295818, longitude: 121.568391, address: "新北市石門區崁子腳"),
    location(name: "富貴角燈塔", photo: "lighthouse", distance: 42, time: 1.25, hour: 14, description: "富貴角燈塔，位於新北市石門區富貴岬角。原名富基角燈塔的富貴角燈塔，塔身原為八角形鐵造，西元1962年改為八角形混凝土塔身，外表為黑白平行相間的條紋，是台灣本島最北的燈塔。富貴角燈塔是日本人在臺灣興建的第二座燈塔，係因日本人為了建造臺灣與日本之間的海底電纜以及航路設備。由於特殊的地理環境及氣候，秋、冬季節常出現濃霧，因此在塔內附設「霧笛」，這是首次在臺灣出現的航路標誌。", latitude: 25.292427, longitude: 121.538427, address: "新北市石門區楓林路1號"),
    location(name: "白沙灣海水浴場", photo: "whitesand", distance: 44, time: 1.25, hour: 14, description: "白沙灣海水浴場，位於石門區麟山鼻與富貴角之間，是由富貴角及麟山鼻合抱而成的半月形天然海灣，向來以沙質潔白聞名，來到這裡的遊客，除了享受貝殼沙踏在腳底的細緻感受，還有各式各樣的水上活動可以參與，游泳、釣魚、帆船、潛水、玩風浪板，都是夏日最受歡迎的活動。", latitude: 25.284223, longitude: 121.518950, address: "新北市石門區德茂里下員坑")]
